export const claim_source_types = [{
  "name": "不声明",
  "id": 0
}, {
  "name": "内容由ai生成",
  "id": 1
}, {
  "name": "素材来源官方媒体/网络新闻",
  "id": 2
}, {
  "name": "内容剧情演绎,仅供娱乐",
  "id": 3
}, {
  "name": "个人观点仅供参考",
  "id": 4
}]


export const HOUSRS = [...Array(24).keys()];
export const MINUTES = [...Array(60).keys()];

export const apperrmsg={
  invalid_session:'当前公众号登录过期',
}

export const wxretmsg={
  13005:'今日有待投放赞助广告，你当前群发的内容不符合条件，此时群发将会导致广告违约，请继续编辑。',
  67010:'该图文消息部分文章正文为空，无法群发，请选择其他文章或编辑完整后再尝试',
  67019:'推荐语不能有违反公众平台协议、相关法律法规和政策的内容，请重新编辑',
  153012:'文章已声明原创，但未设置转载类型，请设置后再群发。',
  200043:'图文中包含没有关联的小程序，请删除后再群发。',
  200047:'标题中不能含有特殊字符',
  1530505:'请勿添加其他公众号的主页链接',
  1530512:'链接已失效，请在手机端重新复制链接',
}
