export const claim_source_types = [{
  "name": "不声明",
  "id": 0
}, {
  "name": "内容由ai生成",
  "id": 1
}, {
  "name": "素材来源官方媒体/网络新闻",
  "id": 2
}, {
  "name": "内容剧情演绎,仅供娱乐",
  "id": 3
}, {
  "name": "个人观点仅供参考",
  "id": 4
}]


export const HOUSRS = [...Array(24).keys()];
export const MINUTES = [...Array(60).keys()];

export const apperrmsg={
  invalid_session:'当前公众号登录过期',
}

export const wxretmsg={
  450: '非管理员/运营者登录，暂不支持群发视频号消息',
  13005: '今日有待投放赞助广告，你当前群发的内容不符合条件，此时群发将会导致广告违约，请继续编辑。',
  14002: '没有“审核通过”的门店。确认有至少一个“审核通过”的门店后可进行卡券投放。',
  14003: '投放用户缺少测试权限，请先设置白名单',

  64004: '剩余定时群发数量不足或今天的群发数量已到，无法群发',
  64520: '保存失败，包含了未发布的投票',
  64522: '文章插入账号名片数超出上限',
  64529: '保存失败，不允许包含多个投票',
  64530: '保存失败，包含了不属于该账号的投票',
  64559: '不支持添加未群发的文章链接',
  64563: '合集链接格式错误，请确认后重试',
  64564: '含有不能被插入的账号，请删除后重试',
  64566: '该账号暂时无法发送含有账号卡片的内容，请删除后重试',
  64568: '含有小程序卡片的封面图域名不符合规范，请删除或更换',
  64573: '添加的小程序链接不允许搜索或被封禁',
  64609: '包含了不合法的小商店商品卡片',
  64701: '不是有效的账号原创文章链接',
  64712: '因原视频被删除，导致转载视频无法播放，请重新上传视频',
  64713: '因原视频被取消原创，导致转载视频无法播放，请重新上传视频',
  64717: '你所转载的原创文章已被删除，请备份内容后重试',
  64721: '普通合集里不能包含付费合集',
  64722: '付费合集id有误, 请重新选择',
  64725: '此合集因违规被封，不支持付费',

  65211: '有部分视频号内容不可引用，请删除或者更换。',
  65212: '有部分视频号内容不可引用，请删除或者更换。',
  65213: '新发表动态暂时无法引用，请稍后重试',
  65214: '预约已失效',
  65215: '视频号活动已结束，请删除后重试',
  65216: '视频号活动违规不可引用，请删除后重试',
  65217: '视频号活动不可引用，请删除后重试',
  65220: '音频已被删除，无法发表',
  65221: '音频因违规无法发表',
  65222: '因作者隐私设置，音频无法发表',
  65223: '因作者隐私设置，音频无法发表',
  65224: '音频审核中',

  67008: '消息中可能含有具备安全风险的链接，请检查',
  67010:'该图文消息部分文章正文为空，无法群发，请选择其他文章或编辑完整后再尝试',
  67011: '设置的定时群发时间错误，请重新选择',
  67012: '设置失败，定时时间与已有互选广告订单时间冲突',
  67013: '设置失败，定时时间超过卡券有效期',
  67014: '该时刻定时消息过多，请选择其他时刻',
  67015: '所选视频状态异常，请重新选择或者前往视频素材库查看详情',
  67016: '视频还在审核中，若审核失败则将无法播放',
  67018: '你已设置过相同时间的定时消息，请到定时列表检查，避免重复操作。',
  67019:'推荐语不能有违反公众平台协议、相关法律法规和政策的内容，请重新编辑',
  67020: '赞赏账户授权失效或者状态异常',
  67023: '内容不能包含外部链接, 请输入以http://和https://开头的公众号相关链接',
  67024: '所选视频状态异常，请重新选择或者前往视频素材库查看详情',
  67025: '所选视频状态异常，请重新选择或者前往视频素材库查看详情',
  67031: '未审核通过的视频不能被使用',
  67032: '含有审核失败的音频，请保存后删除或替换素材',
  67033: '含有审核中的音频，请保存后等待审核通过再重试',
  67034: '含有转码失败的音频，请保存后删除或替换素材',
  67035: '含有转码中的音频，请保存后等待转码和审核通过再重试',
  67036: '转码中、审核中、转码失败、审核失败及已下架的音频不支持发表，请保存后重试',
  67037: '含有已下架的音频，请保存后删除或替换素材',
  67043: '公益捐赠项目失效，请删除',

  811e3: '根据监管要求,账号关注用户数达到1万后,需完成实名验证才可继续使用公众号服务。',

  153012:'文章已声明原创，但未设置转载类型，请设置后再群发。',
  154017: '请先绑定管理员再进行群发操作',
  154020: '账号发表能力被封禁，无法发表',
  155001: '本月发表付费文章已达10篇|每个月发送的付费文章最多10篇,本月你已超过限制数量,不能再发送付费文章',

  200001: '图文内包含的音频已被删除，请重新添加。',
  200002: '系统繁忙，请稍后重试',
  200003: 'session失效',
  200008: '请输入验证码',
  200013: '操作太频繁，请稍后再试',
  200043:'图文中包含没有关联的小程序，请删除后再群发。',
  200046: '图文内含有不合法的音频，请重新上传后再次插入。',
  200047:'标题中不能含有特殊字符',
  200050: '文章插入视频号卡片数超出上限',
  200051: '文章插入视频号卡片能力已被封禁',

  202605: '账号付费功能被封禁期间不可群发付费内容',
  202606: '请重新选择正确的价格',
  202610: '账号未开通付费功能，不可群发付费内容',
  202700: '保存失败，红包封面数据异常',
  202701: '保存失败，每篇图文最多插入十款红包封面',
  202702: '请删除红包封面后再保存',
  202901: '文章插入直播间超过数量限制',
  202902: '文章插入直播间失败',
  202903: '没有权限插入直播间',
  202905: '直播能力已被封禁，文章不能包含直播卡片',
  202906: '文章插入直播间已过期',

  203001: '文章插入读者讨论卡片数超出上限',
  203002: '读者讨论能力已被封禁，文章不能包含读者讨论卡片',
  203003: '尚未开通读者讨论功能，文章不能包含读者讨论卡片',
  203009: '保存失败，读者讨论功能已暂停内测，请删除读者讨论插件后保存',

  342002: '含有未上架的小商店商品',
  342003: '含有非公众号关联商店的商品',
  353001: '文章内商品存在违规，请删除后群发',
  442001: '账号新建/编辑素材能力已被封禁，暂不可使用。',

  720002: '二维码已过期，请关闭弹窗重试群发',
  720003: '操作繁忙',
  720005: '请先绑定管理员再进行群发操作',
  770001: '功能升级中，暂无法发布',

  1530505:'请勿添加其他公众号的主页链接',
  1530512:'链接已失效，请在手机端重新复制链接',
}
